shattlebip/app/controllers/games_controller.rb

  def create
  	# binding.pry
    @game = Game.new(game_params)

    if @game.save
---
INSERT INTO "games" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "New Game"], ["created_at", "2016-09-15 16:55:37.186671"], ["updated_at", "2016-09-15 16:55:37.186671"]]