shattlebip/app/controllers/sessions_controller.rb

	def create
		authorized_user = User.find_by(email: params[:email]).try(:authenticate, params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "user@example.com"]]